Tekla Open API Reference for Tekla Structures 2025
PourObject.PourAttributes.SectionFaceHatch Property
 The hatch type of the section face hatch.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectHatchAttributes SectionFaceHatch { get; set; }
Public Property SectionFaceHatch As ModelObjectHatchAttributes
	Get
	Set
Property Value
Type: ModelObjectHatchAttributes
See Also
Reference
PourObject.PourAttributes Class
Tekla.Structures.Drawing Namespace